<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Brage's Redemption</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="readme/bgreadme.css" type="text/css" rel="stylesheet" />
</head>
<body>

<table border="0" width="100%" cellpadding="0" cellspacing="0" align="center">
<tr>
	<td align="center"><a href="https://www.baldurs-gate.de/index.php"><img src="readme/BannerSword.png" border="0" alt="Baldur's Gate Forum" /></a></td>
	<td align="right">
		&nbsp;
	</td>
</tr>

</table>
<h1>Brage's Redemption - Brage NSC f&uuml;r das BG Epos</h1>
<div class="section"> 
  <p><strong><a href="https://www.baldurs-gate.de/index.php">Eine Kerzenburgforum-Modifikation</a><br />  </strong>
    Text und Coding: jastey<br />
	Portrait: Acifer<br />
  <p><strong>Version Beta 3</a></strong><br />
    <strong> Sprachen:</strong> Deutsch, Englisch<br />
    <strong>Platform: </strong>Windows</p> 
  <p>Brage's Redemption ist eine Questmod f&uuml;r BG1 und eine NSC Mod f&uuml;r das ganze Baldur's Gate Epos. Direkt kompatibel mit BG:EE, SoD, BGII, BGT, BGII:EE, EET. Nicht mit Tutu.</p>
    <img src="readme/bragepromo.png"><br /><br />
</div>


<h2>Inhalt</h2>
<div class="section">
  <ol>
    <li><a href="#install">Installation</a></li>
    <li><a href="#compat">Kompatiblit&auml;t mit anderen Mods</a></li>
    <li><a href="#content">Modinhalte</a>
      <ul> 
		<li><a href="#generalcontent">Generelles</a> </li>
        <li><a href="#quest">Startquest: Brages Schwert</a> </li>
		<li><a href="#npc">Brage als aufnehmbarer NSC</a> </li>
		<li><a href="#stats">Brages Eigenschaften und Portrait</a> </li>
		<li><a href="#spoiler">Walkthrough / Spoilers</a> </li>
      </ul> 
    </li> 
    <li><a href="#acknow">Danksagungen</a></li> 
    <li><a href="#credit">Copyright</a></li>
    <li><a href="#version">Versionshistorie</a> </li> 
  </ol> 
</div> 

<h1><a name="install" id="install">Installation</a></h1>
<div class="section">
Entpackt den Ordner "c#brage" und die "setup-c#brage.exe" in Euer Spielverzeichnis (BG:EE/SOD/BG2/BGT/BGII:EE/EET), startet die exe durch Doppelklick und folgt den Anweisungen auf dem Bildschirm. Das Spiel darf w&auml;hrend der Installation nicht bereits laufen.
</div>

<h1><a name="compat" id="compat">Kompatiblit&auml;t mit anderen Mods</a></h1>
<div class="section">
Brage's Redemption wurde mit WeiDU und mit dem Anspruch gr&ouml;&szlig;tm&ouml;glicher Kompatibilit&auml;t mit anderen Mods erstellt. Die Mod sollte jedoch vor dem BG1NPC Projekt installiert werden, damit die M&ouml;glichkeit, Brage auch Oublek auszuliefern, nicht &uuml;berschrieben wird. F&uuml;r EET, f&uuml;r das es keine direkt kompatible Version des BG1NPC Projektes gibt, kann dies erreicht werden, indem die Komponente "Brages Schwert" der <a href="https://www.baldurs-gate.de/index.php?resources/jasteys-baldurs-gate-mini-quests-and-begegnungen-modifikation.17/">Baldur's Gate Mini Quests and Encounters Mod (bgqe)</a> vor dem BG1NPC Project in die BG:EE (SoD)-Installation installiert wird. Wird der Quest durch bgqe installiert, wird er von der Mod Brage's Redemption entsprechend erkannt.<br />
</div>

<h1><a name="content" id="content">Modinhalte</a></h1>
<div class="section">
<h2> <a name="generalcontent" id="generalcontent">Generelles</a></h2>
Die Mod f&uuml;gt zun&auml;chst eine Questerweiterung zur originalen Brage-Quest in BG1 ein. Brage ist der Hauptmann der Garde in Nashkell, der verschwunden ist, nachdem er seine Familie get&ouml;tet hat. Die Questerweiterung, durch die seine Unschuld bewiesen werden kann, war urspr&uuml;nglich eine eigenst&auml;ndige Komponente in der Mod <a href="https://www.baldurs-gate.de/index.php?resources/jasteys-baldurs-gate-mini-quests-and-begegnungen-modifikation.17/">bgqe</a> mit dem Namen "Brages Schwert".<br /> 
Damit Brage in BG1 als NSC in die Gruppe aufgenommen werden kann, muss zuerst seine Unschuld bewiesen und ihm sein richtiges Schwert gegeben werden. Sobald der HC den Tempel einmal verlassen hat und wieder zurückkehrt, kann Brage im Tempel des Helm in Nashkell aufgesucht werden, und er wird dem HC anbieten, ihn zu begleiten.<br />
Die Quest um seine Unschuld zu beweisen kann vor dem ersten Betreten der Minen von Nashkell erledigt werden. Siehe hierzu die Tipps in der Sektion Walkthrough/Spoilers.<br />
<h2> <a name="quest" id="quest">Startquest: Brages Schwert (BG1-Inhalt)</a></h2>
Durch die Mod kann man die Hintergr&uuml;nde um Brages verfluchten Zweihänder erkunden und nachweisen, dass Brage Opfer einer Intrige geworden ist und ihn so vor dem Galgen retten - wenn man das m&ouml;chte.<br />
Voraussetzung ist, dass man Brage lebend nach Nashkell bringt. Hierzu f&uuml;gt die Mod die M&ouml;glichkeit ein, ihn auch an Oublek auszuliefern, wie es im Originalspiel urspr&uuml;nglich vorgesehen aber nicht spielbar war. (Hierzu die obige Warnung bzgl. der Installationsreihenfolge beachten.)<br />
Es existieren b&ouml;se Questl&ouml;sungen, die zu einer Verurteilung Brages zum M&ouml;rder enden, f&uuml;r welche Brage danach nicht mehr im Spiel als aufnehmbarer NPC zur Verf&uuml;gung steht.<br />
<h2> <a name="npc" id="npc">Brage als aufnehmbarer NSC</a></h2>
<strong>BG1:</strong><br /><br />
Nachdem Brages Unschuld bewiesen wurde, er sein echtes Schwert akzeptiert hat und der HC einmal aus dem Tempel getreten ist - als symbolische Zeit, die Brage braucht, um seine Gedanken zu ordnen - wird Brage den HC bitten, sich ihm/ihr anschlie&szlig;en zu d&uuml;rfen. Brage m&ouml;chte dem/der HC einerseits eine Gegenleistung f&uuml;r die Hilfe geben, andererseits aber auch selbst daran mitarbeiten, die Hinterm&auml;nner der Intrige gegen ihn zu stellen. Sein Gesuch muss nicht sofort akzeptiert werden, sondern er kann auch sp&auml;ter noch im Tempel rekrutiert werden.<br />
Der BG1-Teil enth&auml;lt einen Freundschaftspfad mit 11 Dialogen, in denen Brage vornehmlich versucht, seine Schuldgef&uuml;hle und seine Trauer zu verarbeiten. Die Dialoge sind am besten f&uuml;r HCs geeignet, die ihm zuh&ouml;ren und ihn unterst&uuml;tzen wollen. Brage hat ebenfalls Dialoge, sog. Banter, mit manchen BioWare NSCs. In Version Beta 1 unterh&auml;lt sich Brage mit den folgenden NSCs: Ajantis, Eldoth, Garrick, Imoen, Minsc & Dynaheir, Montaron, Viconia, Xzar, Yeslick. Es gibt weitere Dialoge, in denen auch die NSCs Edwin, Jaheira und Khalid etwas sagen, wenn sie zu diesem Zeitpunkt in der Gruppe sind. Brage reagiert auf die wichtigen Spiel-Meilensteine, hat aber sonst bisher keine direkten Einmischdialoge. Er ist in Nashkell bekannt und provoziert dort Reaktionen der Bewohner. Brage hat einen kleinen "Klickdialog" (PID) der im Laufe des Spiels keine weiteren Frageoptionen erh&auml;lt.<br />
Um mit Eldoth und Viconia alle Banter zu erhalten, sollten die meisten verfluchten Gegenst&auml;nde, die im Spiel gefunden werden k&ouml;nnen, identifiziert und ins Inventar gelegt werden.<br />
Nach 2/3 der Freundschaftsdialoge bittet Brage darum, nach Nashkell zur&uuml;ckzukehren um das Grab seiner Familie zu  besuchen. Der HC muss nicht bei dem eigentlichen Gang zum Friedhof dabei sein um diesen Quest sinnvoll abzuschlie&szlig;en, in diesem Fall wird aber etwas mehr Inhalt zu sehen sein (&uuml;ber den Barge sonst berichtet, wenn man ihn wiedertrifft).<br /><br />
<strong>SoD:</strong><br /><br />
In der Version Beta 1 gibt es keinen nennenswerten SoD-Inhalt. Brage bleibt wie ein Multiplayer-NSC einfach in der Gruppe und l&auml;uft mit, bis er aus der Gruppe entlassen wird.<br /><br />
<strong>BGII:</strong><br /><br />
In der Version Beta 1 existiert kein offizieller BGII-Inhalt. Die bereits bestehenden Inhalte wurden noch nicht ins Deutsche &uuml;bersetzt:<br />
Brage ist im Tempel des Helm im Tempelbezirk zu finden, nachdem der Quest um das Blicklose Auge von einem der drei Tempel akzeptiert wurde. Er kann nun in die Gruppe aufgenommen werden.<br />
In TdB kann Brage &uuml;ber den Fate Spirit im Einsprengsel herbeigerufen werden, wenn er beim &Uuml;bergang von SvA nicht in der Gruppe war.<br />
Brage hat Banter mit Anomen und Nalia.<br />

<h2> <a name="stats" id="stats">Brages Eigenschaften und Portrait</a></h2>
Wenn Brage das erste mal in BG1 getroffen wird, ist er ein K&auml;mpfer auf Stufe 3. Er hat zwei Sterne auf Zweih&auml;nder, zwei Sterne auf Armbrust und einen Stern auf Kampf mit zweih&auml;ndigen Waffen. Wenn der/die HC eine h&ouml;here Stufe hat als er, dann erh&auml;lt er beim ersten Beitreten der Gruppe entsprechende Erfahrungspunkte. F&uuml;r ein kontinuierliches Spiel gilt dies auch f&uuml;r das Aufnehmen nach vom Originalspiel induzierten Trennungen wie z.B. zu Beginn von SoD, zu Beginn von BGII und beim Beschw&ouml;ren &uuml;ber den FateSpirit im TdB.<br /><br />
Brage ist Rechtschaffen Neutral. (Seine Gesinnung weicht damit von der seiner originalen Spielcharater-Dateien ab, die eine Chaotisch Neutrale Gesinnung aufweisen, da diese meines Erachtens dem Berserkerrausch geschuldet ist, in dem man ihn dort findet.)<br /><br />
Seine Eigenschaften wurden der originalen Spielcharater-Datei entnommen:
      <ul> 
		<li>STR: 18/23</li>
		<li>DEX: 11</li>
		<li>CON: 17</li>
		<li>INT: 12</li>
		<li>WIS: 8</li>
		<li>CHA: 13</li>
      </ul> <br />
In der deutschen Version wurde f&uuml;r Brage das Soundset "HoW_Male_2" aus IWD:TotLM verwendet.<br /><br />
Brages Portrait wurde von Acifer angefertigt und dankenswerterweise zur Verf&uuml;gung gestellt.<br /><br />
    <img src="readme/brage.png">
<h2> <a name="spoiler" id="spoiler">Walkthrough / Spoilers</a></h2>	
***** Spoiler f&uuml;r die BG1-Anfangsquest *****<br />
Eine Rolle spielt der H&auml;ndler Borda, den man im Originalspiel auf der Karte mit dem Xvartdorf trifft. Je nach Queststatus kann man ihn hier beim ersten Treffen konfrontieren. Ansonsten gibt es ein zweites Treffen, &uuml;ber dessen ungef&auml;hrer Ort der HC im Spiel erfahren kann.<br />
Brages verfluchtes Schwert spielt ebenfalls eine Rolle. Es muss zur entsprechenden Zeit dem Priester Nalin im Tempel von Nashkell zur Begutachtung vorgelegt werden. Danach spielt es keine Rolle mehr (kann also z.B. f&uuml;r Thalantyr's Item Upgrade Mod verwendet werden).<br /> 
Die Quest kann vollst&auml;ndig vor dem ersten Betreten der Mine beendet werden, kann aber auch sp&auml;ter erledigt werden.<br />
Der schnellste Weg (vor allem vor dem Betreten der Minen, damit man Brage dorthin mitnehmen kann), um die Anfangsquest zu erledigen ist wie folgt:
      <ul> 
		<li>Auf der Karte mit dem Xvartdorf mit dem fahrenden H&auml;ndler Borda sprechen. Wenn man ihn hier bedroht und bek&auml;mpft, erh&auml;lt man sofort einen wichtigen Brief und Brages echtes Schwert. Dies ist aber nicht n&ouml;tig, um die Quest vor dem Betreten der Minen abzuschlie&szlig;en.</li>
		<li>Zu Brage gehen. Wenn Borda nicht get&ouml;tet wurde, m&uuml;sste Brages Kusine Laryssa am Leben gelassen werden, um den Quest vor dem Banditenlager abschlie&szlig;en zu k&ouml;nnen. Brage muss lebend nach Nashkell gebracht werden. Hierbei spielt es keine Rolle, ob er in den Tempel zu Nalin gebracht wird oder die durch die Mod eingef&uuml;gte M&ouml;glichkeit genutzt wird, ihn Oublek auszuliefern.</li>
		<li>Im Gespräch mit Oublek die Quest "Captain Brages Schuld" erhalten.</li>
		<li>Den verfluchten Zweih&auml;nder dem Priester Nalin im Tempel von Nashkell zeigen um von ihm best&auml;tigt zu bekommen, dass er verflucht ist.</li>
		<li>Wenn der H&auml;ndler Borda noch nicht get&ouml;tet wurde, trifft man nun Laryssa vor dem Tempel, die einen Hinseis zu einem H&auml;ndler auf dem Karneval in Nashkell gibt. Dieser H&auml;ndler befindet sich im s&uuml;dlichsten Zelt.</li>
		<li>Oublek vom Fluch auf dem Zweih&auml;nder erz&auml;hlen, den Nalin best&auml;tigt hat.</li>
		<li>Wenn der fahrende H&auml;ndler Borda noch am Leben ist, nun zu dem H&auml;ndler auf dem Karneval (im s&uuml;dlichsten Zelt) gehen und ihn mit den Vorw&uuml;rfen konfrontieren, bis er verr&auml;t, wo man Borda finden k&ouml;nnte.</li>
		<li>Auf die Suche nach Borda begeben: wenn er noch nie geroffen wurde, befindet er sich auf der Karte mit dem Xvartdortf. Wenn er dort bereits vorher getrofffen wurde, dann nun einmal das Lotuszelt auf dem Karneval betreten (westlichstes Zelt). Beim Verlassen des Zeltes wird Borda die Gruppe ansprechen. Borda mit den Vorw&uuml;rfen konfrontieren und den Brief und Brages echtes Schwert einsammeln.</li>
		<li>Oublek den Brief geben, um Brages Unschuld zu beweisen.</li>
		<li>Noch einmal mit Oublek sprechen, um Brages Gerichtsszene zu triggern.</li>
		<li>Nachdem seine Unschuld festgestellt wurde, kann Brage im Tempel in Nashkell gefunden werden. Er muss &uuml;berredet werden, sein richtiges Schwert anzunehmen.</li>
		<li>Nachdem Brage sein richtiges Schwert angenommen hat und er einmal im Tempel alleine gelassen wurde, wird der Priester Nalin der Gruppe sagen, dass Brage mit dem HC sprechen m&ouml;chte. Brage wird nun darum bitten, in die Gruppe aufgenommen zu werden.</li>
      </ul> <br />	  
Hinweis: Falls man Borda bei der Originalbegegnung beim Xvartdorf nicht get&ouml;tet hat, Laryssa jedoch als Infogeberin ausf&auml;llt (weil man sie also vor der Konfrontation mit Brage get&ouml;tet hat), findet man den letzten Hinweis (erst) in Tazoks Zelt im Banditenlager.<br />
</div>


<h1><a name="acknow" id="acknow">Danksagungen</a></h1>
<div class="section">
<strong>Acifer:</strong> Portrait, Promotion-Bild, Ideen, D&D-Wissen. Danke f&uuml;r die tollen Bilder, durch sie hat das Arbeiten an dieser Mod noch mehr Spa&szlig; gemacht!</br>
<strong>Lumorus:</strong> Danke f&uuml;r die Idee, aus Brage einen NSC zu machen und den Hinweis, dass er ja aus Amn kommt und man ihn daher ohne Verrenkungen in BGII in Atkatla wiedertreffen kann. Ohne h&auml;tte ich an dieser Mod nicht gearbeitet!</br> 
</br>
Danke an BioWare, Black Isle und Wizards of the Coast f&uuml;r Baldur's Gate 1, 2 und die Infinity Engine, und BeamDog f&uuml;r das Neuauflegen der Spiele.</br>
Danke ans Kerzenburgforum f&uuml;r das Hosten der Mod und das Bereitstellen von Austauschm&ouml;glichkeiten mit anderen Moddern und Spielern.</br>
Danke an alle Modder die f&uuml;r die IE-Engine Modding Tools entwickelt haben oder gerade pflegen. Ohne w&auml;re diese Modifikation nicht m&ouml;glich gewesen.</br>
Danke an alle, die diese oder meine anderen Modifikationen spielen, und f&uuml;r Euer Feedback welches es mir erm&ouml;glicht, sie zu verbessern. Ohne Euch w&uuml;rd's nicht viel Spa&szlig; machen!</br>
</div>

<h1><a name="credit" id="credit">Copyright</a></h1>
<div class="section">
This mod is unofficial Fan Content permitted under the Fan Content Policy. Not approved/endorsed by Wizards. Portions of the materials used are property of Wizards of the Coast. ©Wizards of the Coast LLC.
This mod is also not developed, supported, or endorsed by BioWare, Black Isle Studios, Interplay Entertainment Corp., Overhaul Games or Beamdog. All other trademarks and copyrights are property of their respective owners.
</div> 

<h1><a name="version" id="version">Versionshistorie</a></h1>
<div class="section">
Version Beta 3:</br>
- Installation nach bgqe sollte nun immer fehlerfrei funktionieren.<br />
<br />
Version Beta 2:</br>
- Der Soldat Hick in der Kaserne ist nicht mehr da, nachmdem man Brage zurückgebracht hat.<br />
- Wenn Brage zum Tempel gebracht wurde, gibt Nalin einen Hinweis, dass der HC mit Oublek sprechen sollte, um mit Barges Quest weiterzukommen.<br />
- Wenn Brage zu Oublek gebracht wurde, spricht dieser nun selbst weiter und vergibt den Quest.<br />
- Nachdem Brage sein richtiges Schwert akzeptiert hat, läuft nun kein Timer mehr, sondern der HC muss den Tempel einmal verlassen. Nach dem erneuten Betreten bittet Brage wie vorher darum, in die Gruppe aufgenommen zu werden.<br /><br />
Version Beta 1:</br>
- Erste Ver&ouml;ffentlichung mit BG1-Inhalten.<br />
<br />
</div>

</body>